[
  {
    "id": "news-1",
    "slug": "kwasu-su-elections-2024",
    "title": "KWASU SU Elections 2024: Call for Nominations",
    "excerpt": "The Students' Union Electoral Committee announces the commencement of nominations for the 2024/2025 academic session elections.",
    "bodyMd": "## KWASU SU Elections 2024: Call for Nominations\n\nThe Students' Union Electoral Committee (SUEC) is pleased to announce the official commencement of nominations for the 2024/2025 academic session elections. This is an opportunity for passionate and dedicated students to serve their fellow colleagues and contribute to the growth of our great institution.\n\n**Key Dates:**\n*   **Nomination Forms Available:** October 1, 2024\n*   **Deadline for Submission:** October 15, 2024\n*   **Screening of Candidates:** October 20-22, 2024\n*   **Campaign Period:** October 25 - November 5, 2024\n*   **Election Day:** November 8, 2024\n\nInterested candidates are advised to pick up nomination forms from the SUEC office located at the Students' Affairs Unit. Please ensure all required documents are submitted before the deadline. Eligibility criteria and guidelines are available with the nomination forms.\n\nWe encourage all eligible students to participate actively in this democratic process, either by contesting or by exercising their right to vote. Your involvement is crucial for a vibrant and effective Students' Union.\n\nFor inquiries, please contact the SUEC Secretary at elections@kwasusu.edu or visit the SUEC office during working hours.\n\n*Signed,\nKWASU SU Electoral Committee*",
    "tags": ["elections", "academic", "announcement"],
    "publishedAt": "2024-09-28T10:00:00Z",
    "coverUrl": "/placeholder.svg"
  },
  {
    "id": "news-2",
    "slug": "welfare-palliative-distribution",
    "title": "SU Announces Palliative Distribution for Students",
    "excerpt": "In response to current economic challenges, the KWASU SU Welfare Department will distribute palliatives to registered students.",
    "bodyMd": "## SU Announces Palliative Distribution for Students\n\nThe KWASU Students' Union, through its Welfare Department, is pleased to announce a palliative distribution program aimed at alleviating the economic burden on our students. This initiative is a testament to our commitment to student welfare and support.\n\n**Distribution Details:**\n*   **Date:** November 15, 2024\n*   **Time:** 9:00 AM - 4:00 PM\n*   **Venue:** University Auditorium\n\n**Eligibility:**\nAll currently registered students of Kwara State University are eligible to receive palliatives. Students are required to present their valid student ID cards at the distribution point.\n\n**Items to be Distributed:**\nThe palliative package will include essential food items and other relief materials. We urge all students to come orderly and cooperate with the distribution team.\n\nThis program is part of the Union's ongoing efforts to ensure that students can focus on their academic pursuits without undue financial stress. We appreciate the support of the university management and other stakeholders in making this possible.\n\nFor further information, please contact the Welfare Secretary at welfare@kwasusu.edu.\n\n*Signed,\nKWASU SU Welfare Department*",
    "tags": ["welfare", "announcement"],
    "publishedAt": "2024-10-05T14:30:00Z",
    "coverUrl": "/placeholder.svg"
  },
  {
    "id": "news-3",
    "slug": "inter-faculty-sports-festival",
    "title": "Inter-Faculty Sports Festival Kicks Off Next Month",
    "excerpt": "Get ready for an exciting Inter-Faculty Sports Festival! Registration opens soon for various sporting events.",
    "bodyMd": "## Inter-Faculty Sports Festival Kicks Off Next Month\n\nThe KWASU Students' Union Sports Department is thrilled to announce the upcoming Inter-Faculty Sports Festival, scheduled to commence next month! This annual event aims to promote sportsmanship, healthy competition, and camaraderie among students from different faculties.\n\n**Events include:**\n*   Football (Male & Female)\n*   Basketball (Male & Female)\n*   Volleyball (Male & Female)\n*   Table Tennis\n*   Chess\n*   Athletics (various track and field events)\n\n**Registration:**\nRegistration for all events will open on October 20, 2024, and close on November 5, 2024. Interested students should register through their respective Faculty Sports Coordinators. Detailed rules and regulations for each sport will be made available upon registration.\n\n**Prizes:**\nExciting prizes await the winning faculties and outstanding individual athletes. Beyond the prizes, the festival offers a fantastic opportunity to showcase talent, build team spirit, and make lasting memories.\n\nWe encourage all students to participate, either as athletes or as enthusiastic supporters. Let's make this year's Sports Festival the most memorable yet!\n\n*Signed,\nKWASU SU Sports Department*",
    "tags": ["events", "sports"],
    "publishedAt": "2024-10-10T09:15:00Z",
    "coverUrl": "/placeholder.svg"
  },
  {
    "id": "news-4",
    "slug": "career-fair-registration-opens",
    "title": "Annual Career Fair: Registration Now Open!",
    "excerpt": "The KWASU SU in collaboration with the Career Services Unit invites students to register for the annual career fair.",
    "bodyMd": "## Annual Career Fair: Registration Now Open!\n\nThe KWASU Students' Union, in partnership with the University's Career Services Unit, is excited to announce that registration for the Annual Career Fair is now open! This event is a prime opportunity for students to connect with leading companies, explore career paths, and secure internship or job opportunities.\n\n**Event Highlights:**\n*   Meet recruiters from various industries.\n*   Attend workshops on resume writing and interview skills.\n*   Network with professionals and alumni.\n*   Discover internship and graduate trainee programs.\n\n**Date:** December 2, 2024\n**Time:** 9:00 AM - 5:00 PM\n**Venue:** University Multipurpose Hall\n\n**How to Register:**\nStudents can register online via the link provided on the SU website or visit the Career Services Unit for assistance. Early registration is encouraged as spaces are limited.\n\nDon't miss this chance to kickstart your career! Prepare your resumes, dress professionally, and come ready to impress.\n\n*Signed,\nKWASU SU Academic & Career Department*",
    "tags": ["opportunities", "academic"],
    "publishedAt": "2024-10-15T11:00:00Z",
    "coverUrl": "/placeholder.svg"
  },
  {
    "id": "news-5",
    "slug": "student-handbook-update",
    "title": "Important Update: Revised Student Handbook Available",
    "excerpt": "The revised KWASU Student Handbook for the 2024/2025 academic session is now available for download.",
    "bodyMd": "## Important Update: Revised Student Handbook Available\n\nThe University Management, in collaboration with the Students' Union, is pleased to announce the release of the revised KWASU Student Handbook for the 2024/2025 academic session. This updated handbook contains crucial information regarding university policies, student conduct, academic regulations, and available support services.\n\n**Key Revisions Include:**\n*   Updated academic calendar dates.\n*   Clarifications on disciplinary procedures.\n*   New guidelines for student organizations.\n*   Enhanced information on health and safety protocols.\n\n**How to Access:**\nThe revised Student Handbook is available for download on the official university website and in the 'Downloads' section of the KWASU SU website. We strongly advise all students to download and thoroughly read the handbook to familiarize themselves with the updated regulations and resources.\n\nUnderstanding the contents of the handbook is essential for a smooth and successful academic journey at KWASU. Ignorance of the rules will not be an excuse for non-compliance.\n\nFor any questions or clarifications regarding the handbook, please contact the Students' Affairs Unit.\n\n*Signed,\nKWASU SU Information Department*",
    "tags": ["academic", "policy", "announcement"],
    "publishedAt": "2024-10-20T08:45:00Z",
    "coverUrl": "/placeholder.svg"
  }
]